name: "ensemble"
platform: "ensemble"
max_batch_size: 256
input [
  {
    name: "INPUT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "input__0"
        value: "INPUT"
      }
      output_map {
        key: "output__0"
        value: "feature_values"
      }
    },
    {
      model_name: "vaccine-predictor"
      model_version: -1
      input_map {
        key: "input__0"
        value: "feature_values"
      }
      output_map {
        key: "output__0"
        value: "OUTPUT"
      }
    }
  ]
}