name: "preprocess"
backend: "python"
max_batch_size: 256
input [
{
    name: "input__0"
    data_type: TYPE_STRING
    dims: [ 1 ]
}
]

output [
{
    name: "output__0"
    data_type: TYPE_FP32
    dims: [ 8 ]
}
]

parameters: {
  key: "EXECUTION_ENV_PATH",
  value: {string_value: "$$TRITON_MODEL_DIRECTORY/python3.8.tar.gz"}
}

instance_group [{ kind: KIND_CPU }]